In [2]:
# 결측치 정제하기
import pandas as pd
import numpy as np

df = pd.DataFrame({'sex' : ['M','F', np.nan, 'M','F'],
                  'score' : [5,4,3,4,np.nan]})
df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [3]:
df['score']+1

0    6.0
1    5.0
2    4.0
3    5.0
4    NaN
Name: score, dtype: float64

In [4]:
# NaN이 있는 상태로 연산시 출력 결과도 NaN

pd.isna(df) # 결측치 확인

     sex  score
0  False  False
1  False  False
2   True  False
3  False  False
4  False   True

In [6]:
pd.isna(df).sum() # 결측치 빈도 확인

sex      1
score    1
dtype: int64

In [7]:
df.dropna(subset = ['score']) # score 결측치 제거

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0

In [8]:
df_nomiss = df.dropna(subset = ['score'])
df_nomiss['score']+1

0    6.0
1    5.0
2    4.0
3    5.0
Name: score, dtype: float64

In [9]:
df_nomiss = df.dropna(subset = ['score','sex'])
df_nomiss

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [12]:
df_nomiss2 = df.dropna() # 모든 변수에 결측치 제거
df_nomiss2

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0